Repository: ardeman/project_bedug_flutter
Catalog: lib/l10n/app_*.arb
Languages: id

# appTagline
source: Your prayer reminder, rooted in Nusantara tradition.
id: Pengingat sholat, seperti bedug di kampung halamanmu.

source: Prayer Times
id: Waktu Sholat

source: Hijri Calendar
id: Kalender Hijriyah

source: Settings
id: Pengaturan

source: Next Prayer
id: Sholat Berikutnya

source: Up next
id: Selanjutnya

source: Recommended
id: Rekomendasi

source: Fajr
id: Subuh

source: Sunrise
id: Terbit

source: Dhuhr
id: Dzuhur

source: Asr
id: Ashar

source: Isha
id: Isya

source: Calculation Method
id: Metode Hisab

# calculationMethodDesc
source: Choose prayer time calculation method
id: Pilih metode perhitungan waktu sholat

# methodKemenag
source: Ministry of Religious Affairs (Indonesia)
id: Kementerian Agama RI

# methodISNA
source: ISNA (North America)
id: ISNA (Amerika Utara)

# methodEgyptian
source: Egyptian General Authority
id: Otoritas Mesir

# methodUmmAlQura
source: Umm Al-Qura (Saudi Arabia)
id: Umm Al-Qura (Arab Saudi)

# methodKarachi
source: University of Karachi
id: Universitas Karachi

# methodSingapore
source: Singapore
id: Singapura

# methodTurkey
source: Turkey
id: Turki

source: Madhab
id: Mazhab

# madhabShafi
source: Shafi'i
id: Syafi'i

source: Azan Notifications
id: Notifikasi Azan

source: All Prayers
id: Semua Sholat

source: Theme
id: Tampilan

# themeSystem
source: System Default
id: Ikuti Sistem

# themeLight
source: Light
id: Terang

# themeDark
source: Dark
id: Gelap

source: Language
id: Bahasa

source: Widget Style
id: Gaya Widget

# widgetCompact
source: Compact
id: Ringkas

source: About
id: Tentang Aplikasi

# version
source: Version {version}
id: Versi {version}

# locationError
source: Failed to get location. Please enable GPS.
id: Gagal mendapatkan lokasi. Pastikan GPS aktif.

# locationGuideAndroid
source: Settings → Apps → bedug → Permissions → Location → Allow
id: Setelan → Aplikasi → bedug → Izin → Lokasi → Izinkan

# locationModeAuto
source: Auto-detect location
id: Deteksi lokasi otomatis

# locationModeAutoDescOn
source: Using device GPS
id: Menggunakan GPS perangkat

# locationModeAutoDescOff
source: Use manual city
id: Gunakan kota manual

source: City
id: Kota

# cityRequiredHint
source: Required when auto-detect is turned off
id: Wajib dipilih jika deteksi otomatis dimatikan

source: Select city
id: Pilih kota

# cityRequiredError
source: Please select a city first in Settings.
id: Pilih kota terlebih dahulu di Pengaturan.

# locationServiceDisabled
source: Location service is disabled. Please enable it in System Settings.
id: Layanan lokasi tidak aktif. Aktifkan di System Settings.

# locationServiceDisabledApple
source: Location service is disabled. Please enable it in System Settings.
id: Layanan lokasi tidak aktif. Aktifkan di System Settings.

# locationServiceDisabledAndroid
source: Location service is disabled. Please enable Location (GPS) in Android Settings.
id: Layanan lokasi tidak aktif. Aktifkan Lokasi (GPS) di Setelan Android.

source: Location permission denied.
id: Izin lokasi ditolak.

# locationPermissionDeniedForever
source: Location permission permanently denied. Open System Settings → Privacy & Security → Location Services → bedug → Allow, then try again.
id: Izin lokasi ditolak permanen. Buka System Settings → Privacy & Security → Location Services → bedug → Allow, lalu coba lagi.

# locationPermissionDeniedForeverApple
source: Location permission permanently denied. Open System Settings → Privacy & Security → Location Services → bedug → Allow, then try again.
id: Izin lokasi ditolak permanen. Buka System Settings → Privacy & Security → Location Services → bedug → Allow, lalu coba lagi.

# locationPermissionDeniedForeverAndroid
source: Location permission permanently denied. Open Settings → Apps → bedug → Permissions → Location → Allow, then try again.
id: Izin lokasi ditolak permanen. Buka Setelan → Aplikasi → bedug → Izin → Lokasi → Izinkan, lalu coba lagi.

# notificationChannelName
source: Prayer Times
id: Waktu Sholat

# notificationChannelDescription
source: Azan reminders for daily prayers
id: Pengingat azan untuk sholat harian

# openAction
source: Open
id: Buka

source: Retry
id: Coba Lagi

source: Loading...
id: Memuat...

source: Today
id: Hari Ini

# hijriToday
source: Today's Hijri Date
id: Tanggal Hijriyah Hari Ini

source: Gregorian Date
id: Tanggal Masehi

source: Sun
id: Min

source: Mon
id: Sen

source: Tue
id: Sel

source: Wed
id: Rab

source: Thu
id: Kam

source: Fri
id: Jum

source: Sat
id: Sab

source: Rabi' al-Awwal
id: Rabi'ul Awal

source: Rabi' al-Thani
id: Rabi'ul Akhir

source: Jumada al-Ula
id: Jumadil Awal

source: Jumada al-Akhirah
id: Jumadil Akhir

source: Sha'ban
id: Sya'ban

source: Shawwal
id: Syawal

source: Dhu al-Qi'dah
id: Dzulqa'dah

source: Dhu al-Hijjah
id: Dzulhijjah

# notifSubuh
source: Fajr prayer time has arrived
id: Waktu Subuh telah tiba

# notifDzuhur
source: Dhuhr prayer time has arrived
id: Waktu Dzuhur telah tiba

# notifAshar
source: Asr prayer time has arrived
id: Waktu Ashar telah tiba

# notifMaghrib
source: Maghrib prayer time has arrived
id: Waktu Maghrib telah tiba

# notifIsya
source: Isha prayer time has arrived
id: Waktu Isya telah tiba
